Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཀུན་དུ་བལྟས་ཏེ། རྩ་བའི་གསང་སྔགས་དོན་ཡོད་ཞགས་པའི་པདྨ་གཙུག་ཏོར་གྱི་ནོར་བུ་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་གསུངས་སོ།
en: Gazing at all the tathāgatas, he taught the root mantra that is the heart essence of Amoghapāśa in his form of Amoghapāśa-Padmoṣṇīṣamaṇi. “

source: །དོན་ཡོད་པའི་སྙིང་པོའི་དཀྱིལ་འཁོར་དུ་པདྨ་གཙུག་གཏོར་གྱི་གསང་བའི་རྣམ་པར་འཕྲུལ་པ་དྲིས་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་དང་པོ་ནི།
en: The first maṇḍala of the rite requested in a miraculous way, the secret of Padmoṣṇīṣa that belongs to the maṇḍala of the heart essence of Amoghapāśa, is as follows: “Homage to the secret amogha maṇḍalas that constitute the uṣṇīṣas of all tathāgatas!

source: དུས་གསུམ་དུ་གཤེགས་ཤིང་རབ་ཏུ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཙུག་ཏོར་དོན་ཡོད་པ་གསང་བའི་དཀྱིལ་འཁོར་གྱི་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: །འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་རང་སངས་རྒྱས་དང་། འཕགས་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the pratyekabuddhas and the congregation of the noble śrāvakas of the past, present, and future!

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་རིགས་ཀྱི་སྙིང་པོའི་དམ་ཚིག་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the heart samayas of the secret families of all tathāgatas!

source: །ཡང་དག་པར་སོང་བ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to those who have reached perfection!

source: །ཡང་དག་པར་ཞུགས་པ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to those of perfect conduct!

source: །བློ་གྲོས་ཆེན་པོ་འཕགས་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the venerable Śāradvatīputra of great mind!

source: །འཕགས་པ་བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་ཚོགས་ཀྱི་མཆོག་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the noble hosts of great bodhisattvas headed by Noble Maitreya!

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཕགས་པ་འོད་དཔག་ཏུ་མེད་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the noble Tathāgata Amitābha, the worthy one, the fully realized Buddha!

source: །པདྨོའི་གཙུག་ཏོར་གྱི་དཀྱིལ་འཁོར་འཆང་བ་ལ་ཕྱག་འཚལ་ལོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཐུགས་རྗེ་ཆེན་པོ་ཅན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the noble bodhisattva Avalokiteśvara, the most compassionate great being who upholds the maṇḍala of Padmoṣṇīṣa!

source: །དྲང་སྲོང་ཆེན་པོ་འཕགས་པའི་ཚོགས་ཀྱི་མཆོག་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the hosts of great, noble sages! “

source: །དེ་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །རྣམ་པར་ཐར་བའི་དཀྱིལ་འཁོར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞལ་ནས་གསུངས་པ།
en: Honoring them, I will now teach this maṇḍala of liberation that originates from the mouth of Noble Avalokiteśvara.

source: དོན་ཡོད་པའི་རྒྱལ་པོའི་པདྨ་གཙུག་ཏོར་གྱི་སྙིང་པོ་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་གསུངས་པ་འདི། བདག་གིས་ད་ལྟར་འཁོར་ཆེན་པོ་ལ་བཤད་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ཨོཾ་པདྨོཥྞཱི་ཥ་བ་ར་ད་ཧཱུཾ། ཙ་ར་ཙ་ར།
en: I will present the heart essence of Amogharāja-Padmoṣṇīṣa to this great assembly, speaking in front of the Tathāgata.

source: ཙུ་རུ་ཙུ་རུ།
en: May this maṇḍala of liberation protect you from every danger!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །ཙི་རི་ཙི་རི།
en: The mantra is: [256] “Oṁ, Padmoṣṇīṣa, the granter of boons, Hūṁ!

source: པི་རི་པི་རི།
en: Cara cara,ciri ciri, curu curu, O most compassionate!

source: ཙི་རི་ཙི་རི། པ་ར་མ་ཀཱ་རུ་ཎི་ཀ །
en: Ciri ciri, piri piri, ciri ciri, O supremely compassionate!

source: སི་རི་སི་རི། ཙི་རི་ཙི་རི། པི་རི་པི་རི། བི་རི་བི་རི། མ་ཧཱ་པདྨ་ཧ་སྟཾ།
en: Siri siri, ciri ciri, piri piri, viri viri, O great one with a lotus in your hand!

source: ཀ་ལ་ཀ་ལ། ཀི་ལི་ཀི་ལི། ཀུ་ལུ་ཀུ་ལུ། མ་ཧཱ་ཤུདྡྷ་སཏྭ།
en: Kala kala, kili kili, kulu kulu, O great pure being!

source: ཨེ་ཧྱེ་ཧི། བུ་དྷྱ་བུ་དྷྱ།
en: Come, come!

source: ཀི་ཎི་ཀི་ཎི།
en: Run, run!

source: ཀུ་ཎུ་ཀུ་ཎུ། པ་ར་མ་ཤུདྡྷ་སཏྭ། ཀ་ར་ཀ་ར། ཀི་རི་ཀི་རི།
en: Kaṇa kaṇa, kiṇi kiṇi, kuṇu kuṇu, O supremely pure being!

source: ཀུ་རུ་ཀུ་རུ། མ་ཧཱ་སྠཱ་མ་པྲཱཔྟ། ཙ་ལ་ཙ་ལ། སཉྩ་ལ། བི་ཙ་ལ།
en: Kara kara, kiri kiri, kuru kuru, you have attained great strength!

source: ཨེ་ཊ་ཊ། ཨེ་ཊ་ཊ། བྷ་ར་བྷ་ར། བྷི་རི་བྷི་རི། བྷུ་རུ་བྷུ་རུ། མ་ཧཱ་བི་མ་ལ།
en: Move, move!

source: པདྨོཥྞཱི་ཥ་བི་ར་ཛ་སཱ་དྷ་ཡ་ཧཱུཾ་ཧཱུཾ། ཨེ་ཧྱེ་ཧི། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །མ་ཧཱ་པ་ཤུ་པ་ཏི།
en: Move together and move separately!

source: བེ་ཥ་དྷ་ར། དྷ་ར་དྷ་ར། མ་ཧཱ་པདྨོཥྞཱི་ཥ་དྷ་ར། ས་ར་ས་ར། སརྦ་ཨཱ་བ་ར་ཎ་ཧ་ར།
en: Eṭaṭa eṭaṭa, bhara bhara,bhiri bhiri, bhuru bhuru, great Padmoṣṇīṣa, stainless and immaculately pure!

source: ཙ་ར་ཙ་ར། སརྦ་བིདྱཱ་དྷ་ར་ན་མ་སྐྲྀ་ཏེ། ཧ་ར་ཧ་ར། སརྦ་ཀིལྤི་ཥ་ཧ་ར། ཧཱ་ཧཱ་ཧཱ་ཧཱ། ཧཱི་ཧཱི་ཧཱི་ཧཱི། ཧཱུ་ཧཱུ་ཧཱུ་ཧཱུ།
en: Accomplish your activities, hūṁ hūṁ!

source: ཨོཾ་ཀཱ་ར་བྲཧྨ་བ་ཥ་དྷ་ར། དྷ་ར་དྷ་ར། དྷི་རི་དྷི་རི། དྷུ་རུ་དྷུ་རུ།
en: Come, come, O most compassionate being who wears the garb of the great Paśupati!

source: མ་ཧཱ་པདྨ་ཛྭ་ལ་དྷ་ར། ཏ་ར་ཏ་ར། ས་ར་ས་ར། པ་ར་པ་ར། པདྩ་པཱ་ས་དྷ་ར།
en: Wear it, wear, you who wear the great lotus-uṣṇīṣa!

source: ཙ་ར་ཙ་ར། བ་ར་བ་ར། བ་ར་ར་ཤྨི་ཤ་ཏ་ས་ཧ་སྲ། པྲ་ཏི་མཎྜི་ཏ་ཤ་རཱི་རཱ་ཡ།
en: Flow, flow, O remover of all obscurations!

source: ཛྭ་ལ་ཛྭ་ལ། ཏ་པ་ཏ་པ། བྷ་ག་བཱ་ན་སོ་མ་ཨཱ་དི་ཏྱ་ཡ་མ། བ་རུ་ཎ། ཀུ་བེ་ར།
en: Act, act, you who are honored by all the vidyā holders!

source: བྲཧྨ། ཨིནྡྲ།
en: Remove them, remove, O remover of all vices!

source: རྀ་ཥི་ག་ཎ། དེ་བ་ག་ཎ། ཨ་བྷྱ་རྩི་ཏ། ཙ་ར་ཎ། སུ་རུ་སུ་རུ།
en: Hā hā, hā hā, hī hī, hī hī, hūṁ hūṁ, hūṁ hūṁ, you who wear the garb of Oṁkāra Brahmā!

source: ཙུ་རུ་ཙུ་རུ། པུ་རུ་པུ་རུ། མུ་རུ་མུ་རུ། ས་ན་ཏ་ཀུ་མཱ་ར།
en: Dhara dhara,dhiri dhiri, dhuru dhuru, O wearer of the blazing light of the great lotus!

source: རུ་ཏྲ། བཱ་ས་བ། བིཥྞུ། དྷ་ན་ད། དེ་བ་རྀ་ཥི། ནཱ་ཡ་ཀ །བ་ཧུ། བི་བི་དྷ། བེ་ཥ་དྷ་ར།
en: Tara tara, sara sara, para para, O holder of the lotus noose!

source: མ་ཧཱ་པདྨ་དཎྜ་དྷ་ར། པཱ་ཤ་དྷ་ར། དྷ་ར་དྷ་ར། དྷི་རི་དྷི་རི་དྷི། དྷུ་རུ་དྷུ་རུ་དྷུ།
en: Cara cara, vara vara, you whose body is adorned with hundreds of thousands of beautiful light rays!

source: ཐ་ར་ཐ་ར། གྷ་ར་གྷ་ར། ཡ་ར་ཡ་ར། ལ་ར་ལ་ར།
en: Blaze, blaze!

source: ཧ་ར་ཧ་ར། པ་ར་པ་ར། ས་ར་ས་ར། ཙ་ར་ཙ་ར། བ་ར་བ་ར།
en: Heat up, heat up!

source: མ་ཧཱ་བ་ར་དཱ་ཡ་ཀ །ས་མནྟ་མཎྜ་ལ།
en: Your feet are worshiped by the blessed Soma, Āditya, Yama, Varuṇa, Kubera, Brahmā, Indra, and the hosts of ṛṣis and devas!

source: ལོ་ཀེ་ཤྭ་ར། མ་ཧེ་ཤྭ་ར། མུ་ཧུ་མུ་ཧུ།
en: You hold the stalk of the great lotus!

source: མུ་རུ་མུ་རུ།
en: You hold the noose!

source: མུ་ཡ་མུ་ཡ། མུཉྩ་མུཉྩ། བྷ་ག་བཱ་ན་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་ར། རཀྵ་རཀྵ། མ་མ་སརྦ་བྷ་ཡཾ་བྷྱཿ།
en: Dhara dhara, dhiri dhiri, dhuru dhuru, thara thara, ghara ghara, yara yara, lara lara, hara hara, para para, para para, cara cara, vara vara, O great granter of boons, the great lokeśvara lord Avalokita whose panoptic gaze spans a full circle!Muhu muhu, muru muru, muya muya, muñca muñca, O Noble Lord Avalokiteśvara, stand guard!

source: སརྦ་བྷ་ཡེ་བྷྱཿ།
en: Stand guard to keep me protected by my treasure trove of morality!

source: སརྦ་ཨུ་པ་དྲ་བེ་བྷྱཿ།
en: Protect me from every danger and every calamity!

source: སརྦ་གྲ་ཧེ་བྷྱཿ།
en: Protect me from all grahas, fevers, and diseases!

source: སརྦ་ཛྭ་རེ་བྷྱཿ།
en: O rescuer from slaughter, imprisonment, beatings, threats, king’s rogues, bandits, fire, water, poison, and weapons!

source: སརྦ་བྱ་དྷི་བྷྱཿ། བདྡྷ་བནྡྷ་ན་ཏཱ་ཌ་ཎ་རྫ་ན། རཱ་ཛ།
en: Kaṇa kaṇa, kiṇi kiṇi, kuṇu kuṇu, cara cara, O teacher of the sense faculties, the strengths, the limbs of awakening, and the four truths of the noble ones!

source: ཙཽ་ར། ཏ་སྐ་ར། ཨགྣི། ཨུ་ད་ཀ །བི་ཥ།
en: Tama tama!

source: ཤ་སྟྲ། པ་རི་མོ་ཙ་ཀ །ཀ་ཎ་ཀ་ཎ།
en: Tame, tame!

source: ཀི་ཎི་ཀི་ཎི། ཀུ་ཎུ་ཀུ་ཎུ། ཙ་ར་ཙ་ར། ཨིནྡྲ་ཡ་བ་ལ།
en: Pacify, pacify!

source: བོ་དྷྱཾ་ག །ཙ་ཏུརྱ་ས་ཏྱ་སཾ་པྲ་ཀཱ་ཤ་ཀ །ཏ་མ་ཏ་མ།
en: Sama sama!

source: ད་མ་ད་མ། ས་མ་ས་མ།
en: O dispeller of the great darkness of ignorance!

source: ས་མ་ས་མ། མ་ཧཱ་ཏ་མོནྡྷ་ཀ་ར་བིདྷ་མ་ན། ཥཊ་བཱ་ར་མི་ཏཱ་པ་རི་པཱུ་ར་ཀ །
en: O fulfiller of the six perfections!

source: མི་ལི་མི་ལི། ཊ་ཊ་ཊ་ཊ། ཋ་ཋ་ཋ་ཋ། ཊི་ཊི་ཊི་ཊི། ཋི་ཋི་ཋི་ཋི། ཊུ་ཊུ་ཊུ་ཊུ།
en: Mili mili, ṭaṭa ṭaṭa, ṭhaṭha ṭhaṭha, ṭiṭi ṭiṭi, ṭhiṭhi ṭhiṭhi, ṭuṭu ṭuṭu, ṭhuṭhu ṭhuṭhu, O wearer of a tunic made from the skin of the black antelope!

source: ཋུ་ཋུ་ཋུ་ཋུ། ཨེ་ནེ་ཡ་ཙརྨ་ཀྲྀ་ཏ་པ་རི་ཀ་ར་ཨེ་ཧྱེ་ཧི། ཨཱི་ཤྭ་ར།
en: Come, come, Īśvara, Maheśvara, and Padmeśvara!

source: མ་ཧེ་ཤྭ་ར། པདྨེ་ཤྭ་ར།
en: O great destroyer of the hosts of bhūtas!

source: མ་ཧཱ་བྷཱུ་ཏ་ག་ཎ།
en: O great lord of siddhas!

source: སཾ་བྷཉྫ་ཀ། མ་ཧཱ་སིདྡྷི་སྭ་ར། ཀུ་རུ་ཀུ་རུ།
en: Act, act!

source: པ་ར་པ་ར། པ་ར་པ་ར། ཀ་ཊ་ཀ་ཊ། མ་ཊ་མ་ཊ། བི་ཤུདྡྷ་པི་ཥ་ཡ།
en: Para para, kaṭa kaṭa, maṭa maṭa, O dweller in the pure realm, endowed with great compassion!

source: ནི་བཱ་སི་ན།
en: You wear the sacred thread, a jewel diadem, and a garland.

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ།
en: Your head has the Omniscient One for its crown jewel!

source: ཤྭེ་ཏ་ཡཛྙོ་པ་བཱི་ཏ་རཏྣ་མ་ཀུ་ཊ་མཱ་ལཱ་དྷ་ར།
en: The palms of your extraordinary hands are made of lotuses!

source: སརྦ་ཛྙཱ་ཤི་ར་སི་ཀྲྀ་ཏ་མ་ཀུ་ཊ་མ་ཧདྦྷུཏཿ་ཀ་མ་ལཱ་ལཾ་ཀྲྀ་ཏ། ཀ་ར་ཏ་ལ།
en: Your meditative concentration, samādhi, and liberation are unshakeable!

source: དྷྱཱ་ན་ས་མཱ་དྷི། བི་མོ་ཀྵ་པྲ་ཀམྤ།
en: You bring to maturity the mindstreams of many beings, O most compassionate being!

source: བ་ཧུ་ས་ཏྭ་སནྟ་ཏི། པ་རི་པཱ་ཙ་ཀ །མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །སརྦ་ཀརྨ་ཨཱ་བ་ར་ཎ་བི་ཤོ་དྷ་ཀ །
en: You purify all karma and obscurations, grant release from all disease, fulfill all wishes, and comfort all beings!

source: སརྦ་བྱཱ་དྷི་པྲ་མོ་ཙ་ཀ །
en: Oṁ, the heart essence maṇḍala of Padmoṣṇīṣapāśa, homage be to you!

source: སརྦ་ཨཱ་ཤཱ་པ་རི་པཱུ་ར་ཀཿསརྦ་ས་ཏྭ། ས་མཱ་ཤྭཱ་ས་ཀ །
en: Svāhā!

source: ཨོཾ་པདྨོ་ཥྞཱི་ཥ་པཱ་ཤ་ཧྲྀ་ད་ཡ་མཎྜ་ལ་ན་མ་སྟུ་ཏེ་སྭཱ་ཧཱ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། དོན་ཡོད་ཞགས་པའི་པདྨ་གཙུག་ཏོར་གྱི་གསང་བའི་སྙིང་པོའི་དཀྱིལ་འཁོར་འདི་གསུངས་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱིས་གཞི་ཆེར་གཡོས་པར་གྱུར་ཏེ།
en: As soon as this maṇḍala of the secret essence of Noble Avalokiteśvara-Amoghapāśa-Padmoṣṇīṣa was spoken, the great trichiliocosm and the earth in this world system began to quake violently.

source: རི་དང་། ནགས་དང་། དགོན་པར་བཅས་པ་རྣམ་པར་འགྱུར་བ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏོ། །ཀུན་ནས་སའི་མཐིལ་འདི་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་གྱི་པདྨའི་གདན་ཀུན་ནས་བཏིང་བར་གྱུར་ཏོ།
en: The mountains, forests, and deserts shook in six different ways, and there appeared a lotus seat that was made of the seven precious jewels and extended over the entire earth.

source: །བཅོམ་ལྡན་འདས་ཕྱག་ན་པདྨའི་ལྟེ་བའི་གནས་ན་པདྨ་ཆེན་པོ་གྱེན་དུ་འཕགས་པ་འདབ་མ་སྟོང་བ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན། བཻ་ཌཱུརྱ་སྔོན་པོ་ཆེན་པོའི་སྡོང་བུ་དང་། འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་སྙིང་པོ་དང་།
en: From the navel of the blessed Padmapāṇi sprang a huge, thousand-petaled lotus that was made from the seven precious jewels and had a sapphire stalk.

source: མུ་ཏིག་དམར་པོའི་ཟེ་འབྲུ་དང་། ལྷའི་མུ་ཏིག་ཆེན་པོའི་གེ་སར་དང་གཅིག་ཏུ་འབར་བར་གྱུར་པ་འོད་ཟེར་སྣ་ཚོགས་པ་འབྱིན་པར་བྱེད་པས་ཏེ། འདི་ལྟ་སྟེ་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་།
en: Its pistil was made of gold from the river Jambu, its pericarp from red pearl, and its huge stamens from pearl.

source: དཀར་པོ་དང་། བཙོད་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ཏུ་སྣང་བཞིན་པས་འབར་ཞིང་། རྣམ་པར་གསལ་བ་ལྷང་ངེའོ།
en: The lotus blazed with a uniform light that radiated in rays of various colors, including blue, yellow, red, dazzling white, maroon, crystal, and silver.

source: །ཕྱོགས་བཅུ་ཀུན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་ཀུན་དུ་སྣང་བར་བྱེད་དོ། །ལྷའི་གནས་དང་། ཀླུའི་གནས་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོའི་གནས་དང་།
en: The light shone upon and brightened the ten directions; it illuminated all buddha fields and all the abodes of devas, nāgas, yakṣas, rākṣasas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: དྲི་ཟའི་གནས་དང་། ལྷ་མ་ཡིན་གྱི་གནས་དང་། ནམ་མཁའ་ལྡིང་གི་གནས་དང་། མི་འམ་ཅིའི་གནས་དང་།
en: It brought happiness, joy, and comfort.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་རྣམས་ཀུན་དུ་སྣང་བར་བྱེད་དོ། །རབ་ཏུ་ཚིམ་པར་བྱེད་དོ། །ཡང་དག་པར་སྐུལ་བར་བྱེད་དོ། །ཡང་དག་པར་དབུགས་འབྱིན་པར་བྱེད་དོ། །དམྱལ་བ་ཆེན་པོ་བཅུ་དྲུག་པོ་རྣམས་ཀུན་དུ་སྣང་ཞིང་རེག་པས་དམྱལ་བ་ཆེན་པོ་དེ་རྣམས་ཀྱང་པདྨ་ཅན་ཆེན་པོར་སྐྱེས་པར་གྱུར་ཏོ།
en: The sixteen great hells were illuminated, too, and they turned into great lotus ponds when touched by the light.

source: །སེམས་ཅན་དམྱལ་བ་དེ་རྣམས་ཀྱང་ཀུན་ནས་སྣང་ཞིང་རེག་པ་ཙམ་གྱིས་དེ་རྣམས་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་ཏེ། བསམས་པ་ཙམ་གྱི་མོད་ལ་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་པདྨ་ལས་རྫུས་ཏེ་སྐྱེས་ཤིང་། ལྷའི་ལུས་ལ་རྒྱན་ལྷབ་ལྷུབ་དང་། གོས་དང་། སྤུད་པས་རྣམ་པར་བརྒྱན་ཅིང་།
en: All hell beings were liberated as soon as they were touched by the light, and then they proceeded, according to their destinies, to the realm of Sukhāvatī, where they were born from lotus flowers, with divine bodies decked with ornaments, adornments, fine clothes, and jewelry.

source: སྐྱེ་བ་ནས་སྐྱེ་བ་རུ་སྐྱེ་བ་དྲན་པར་སྐྱེས་སོ།
en: They were able to recollect their successive births.

source: །དེ་བཞིན་དུ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བ་རྣམས་ཀུན་ནས་སྣང་བས། རི་དགས་དང་། བྱ་དེ་དག་ཐམས་ཅད་ཀྱང་དུད་འགྲོའི་སྐྱེ་གནས་ལས་ཡོངས་སུ་གྲོལ་ཏེ། མཐོ་རིས་སུ་རྣ་རྒྱན་དྲི་མ་མེད་ཅིང་གཡོ་བ་འཛིན་པར་སྐྱེས་སོ།
en: Similarly, when the light shone upon animals—beasts and birds—they were all liberated and were reborn in heavenly realms, where they were adorned with beautiful, swinging earrings.

source: །དེ་བཞིན་དུ་ཕྱོགས་བཅུ་ཀུན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀུན་དུ་སྣང་ཞིང་རེག་པ་དེ་རྣམས་ཐམས་ཅད་ས་ཆེན་པོ་བརྒྱད་པ་ལ་རབ་ཏུ་གནས་པར་གྱུར་ཏོ།
en: The light thus shone on all beings throughout the ten directions, and when it touched them it established them all on the eight great levels.

source: །དེས་ཀྱང་འཁོར་ཆེན་པོར་ཀུན་དུ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་རྣམས་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་བཀོད་པར་གྱུར་ཏོ།
en: The bodhisattvas who had gathered in that great assembly in great numbers were established in unsurpassable perfect awakening, from which there is no turning back.

source: །རིག་སྔགས་འཆང་གི་འཁོར་གང་ཡིན་པ་ཐམས་ཅད་ཀྱང་དོན་ཡོད་པ་པདྨའི་གཙུག་ཏོར་ཆེན་པོའི་སྙིང་པོ་གསང་བ་དོན་ཡོད་ཞགས་པའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་པར་གྱུར་ཏོ།
en: All the assembled vidyādharas attained the accomplishment of Amoghapāśa—the secret amogha essence of the great Padmoṣṇīṣa.

source: །ཀླུའི་རྒྱལ་པོའི་འཁོར་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་ཀྱང་ཡིད་བཞིན་གྱི་ནོར་བུའི་རྒྱལ་མཚན་སོ་སོར་སྣང་བར་གྱུར་ཏོ།
en: All the assembled nāga kings became shining banners crowned by a wish-fulfilling jewel.

source: །ལྷའི་འཁོར་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་ཀྱང་འོད་འབར་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་བོ།
en: All the assembled devas attained the samādhi blazing torch.

source: །གནོད་སྦྱིན་དང་སྲིན་པོ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་རིན་པོ་ཆེའི་གཞལ་མེད་ཁང་དུ་གནས་པར་གྱུར་ཏོ།
en: All the assembled yakṣas and rākṣasas obtained jeweled palaces for their dwellings.

source: །འབྱུང་པོའི་འཁོར་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་གཟི་བརྗིད་དྲི་མ་མེད་པའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་པར་གྱུར་ཏོ།
en: All the assembled bhūtas attained the samādhi immaculate brilliance.

source: །ལྷ་མ་ཡིན་གྱི་འཁོར་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་རྡོ་རྗེའི་གོ་ཆ་དང་རྡོ་རྗེ་རྒྱལ་མཚན་གྱི་ཡ་ལད་བགོས་པར་གྱུར་ཏེ།
en: All the assembled asuras were protected by vajra armor and vajra banners.

source: ནམ་མཁའ་ལྡིང་གི་འཁོར་གང་ཡིན་པ་ཐམས་ཅད་རྡོ་རྗེ་མཆུ་རྩེ་མོ་ཆེན་པོའི་སྟོབས་ཀྱི་ཤུགས་རྗེས་སུ་ཐོབ་པར་གྱུར་ཏོ། །མིའམ་ཅི་དང་།
en: All the assembled garuḍas obtained great vajra beaks and crests and acquired great strength and speed.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་འཁོར་གང་ཡིན་པ་ཐམས་ཅད་ཀྱང་ལུས་དང་ངག་དང་ཡིད་ཡོངས་སུ་དག་པར་གྱུར་ཏོ། །དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། བུད་མེད་དང་།
en: All the assembled kinnaras and mahoragas underwent a complete purification of their body, speech, and mind.

source: སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བའི་སྡུག་བསྔལ་ལས་ཡོངས་སུ་གྲོལ་བར་གྱུར་ཏོ།
en: All the assembled male and female lay practitioners—women, men, boys, and girls—were liberated from the suffering of birth, old age, and death.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་སྐུ་ལས་ཉི་མའི་ཏོག་ཅེས་བྱ་བའི་འོད་ཟེར་ཆེན་པོ་རྣམ་པར་སྤྲོས་ཏེ།
en: The body of the Blessed One emitted a great light called bright as the sun.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཐུགས་ཀར་རྗེས་སུ་ཞུགས་སོ།
en: The light entered into the heart of Noble Avalokiteśvara, the great being.

source: །སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཐུགས་ཀར་ཞུགས་མ་ཐག་ཏུ་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལག་ན་རྡོ་རྗེ་དོན་ཡོད་ཞགས་པའི་པདྨ་གཙུག་ཏོར་གྱི་གསང་བའི་རྣམ་པར་འཕྲུལ་པ་ལྟོས་ཤིག །
en: As soon as it entered his heart, Avalokiteśvara said to Vajrapāṇi, the great yakṣa general, “Look, Vajrapāṇi, at the miraculous display of the secret heart essence of Amoghapāśa-Padmoṣṇīṣa.”

source: ལག་ན་རྡོ་རྗེས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་མཐོང་ལགས་སོ།
en: Vajrapāṇi replied, “I saw it, Lord!

source: །སེམས་དཔའ་དག་པ་བདག་གིས་མཐོང་ལགས་སོ། །སེམས་དཔའ་ཆེན་པོ་དག་པ་འདིའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་པདྨའི་དབང་ཕྱུག་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་པདྨ་གཙུག་ཏོར་གྱི་གསང་བའི་སྙིང་པོའི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཟབ་པ། ཤིན་ཏུ་རྒྱ་ཆེ་བ།
en: I saw this inconceivable miraculous display, O pure being! This maṇḍala of the secret heart essence of Padmoṣṇīṣa, the heart essence of the lotus lord Amoghapāśa, is extremely profound and vast!

source: རྨད་དུ་བྱུང་བ་ཆེན་པོ་དངོས་གྲུབ་མཆོག་སྒྲུབ་པར་བྱེད་པ་ནི་བཅོམ་ལྡན་འདས་མཐའ་དག་རྒྱས་པར་གསུངས་ཤིག །
en: Please, Lord, teach at length this marvelous, supreme practice and its accomplishment!

source: གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། རིག་སྔགས་དང་། དཀྱིལ་འཁོར་རྨད་དུ་བྱུང་བ་ཉེ་བར་སྤྱོད་པའི་ཆོ་ག་དང་བཅས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡིག་པ་རྣམ་པར་འཇོམས་པའི་དོན་དང་། རིག་སྔགས་འཆང་རྣམས་ཀྱི་མཆོག་འགྲུབ་པའི་དོན་དུ་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་གསུངས་ཤིག །
en: Teach this extraordinary vidyā maṇḍala that comprises a collection of mantras, along with its conduct and procedures! Teach it in the presence of the Tathāgata, in order to destroy the wrongdoings of all beings and for the sake of the supreme accomplishment of all vidyā holders!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལག་ན་རྡོ་རྗེ་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་མཆོག་ཏུ་གསང་བ་གཙུག་ཏོར་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཆེད་དུ་སྡིག་པ་ཐམས་ཅད་ཉམས་པར་བྱེད་པ། །སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སྦྱོང་བར་བྱེད་པ། དྲི་མ་དང་། རྙོག་མ་ཐམས་ཅད་སེལ་བར་བྱེད་པ། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། བཀྲ་མི་ཤིས་པ་ཐམས་ཅད་ཟློག་པར་བྱེད་པ། སྡིག་པ་དང་།
en: Noble Avalokiteśvara, the great bodhisattva being, replied to Vajrapāṇi, the great yakṣa general, “Receive, Vajrapāṇi, the complete uṣṇīṣa maṇḍala, the most secret heart essence of Amoghapāśa!

source: མ་རུངས་པའི་སེམས་ཅན་ཕྱིར་རྒོལ་བ་དང་།
en: Receive it for the sake of all beings!

source: དགྲའི་འཇིགས་པ་རབ་ཏུ་ཞི་བར་བྱེད་པ། བགེགས་དང་། ལོག་པར་འདྲེན་པ་ཐམས་ཅད་ཚར་གཅོད་པར་བྱེད་པ། །བདུད་ལ་སོགས་པའི་མ་རུངས་པ་ཐམས་ཅད་འཇོམས་པར་བྱེད་པ་དུག །མཚོན་ཆ་དང་། མེ་དང་། ཆུའི་འཇིགས་པ་དང་།
en: This maṇḍala exhausts all nonvirtue, purifies all obscurations, clears away all dirt and impurities, pacifies all disease, prevents anything inauspicious, stops all vice, pacifies all fear of opponents and adversaries, restrains all vighnas and vināyakas, crushes all wicked beings, such as the māras, and prevents the dangers that arise due to poison, weapons, fire, water, āśīviṣa snakes, lions, kings, and yakṣas.

source: མཆེ་བའི་དུག་དང་། སེང་གེ་དང་། རྒྱལ་པོ་དང་། གནོད་སྦྱིན་རྣམས་ཟློག་པར་བྱེད་པ། དུག་དང་། བྱད་སྟེམས་དང་།
en: It destroys all garas, kākhordas, kiraṇas, and those who employ poisonous powders.

source: གཡེང་བྱེད་དང་།
en: This maṇḍala is the heart essence of Amoghapāśa; it is the true essence of his extraordinary nature.

source: ཕྱེ་མའི་སྦྱོར་བ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་པ།
en: It constitutes the true essence of practice.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་དེ་ཁོ་ན་ཉིད་གཅེས་པ་རྨད་དུ་བྱུང་བ་དེ་ཁོ་ན་ཉིད་ཀྱི་སྙིང་པོའི་སྒྲུབ་པ་བླ་ན་མེད་པ་བཀླགས་པས་གྲུབ་པ་འདི་རྗེས་སུ་ཟུང་ཤིག །
en: When recited, it will bring the supreme accomplishment.”

source: དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་བཞིན་འཛུམ་ཅིང་། གདོང་ཁྲོ་གཉེར་དང་བྲལ་བས་རྡོ་རྗེ་བསྐོར་བར་བྱེད་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཅོམ་ལྡན་འདས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་དམ་པར་གྱུར་པ་གསང་བ་པདྨ་གཙུག་ཏོར་གྱི་དཀྱིལ་འཁོར་དེ་རྣམས་དུ་ཞིག་ལགས།
en: Vajrapāṇi, the great yakṣa general, waved his vajra with a smile on his face, instead of the usual frown, and said to Avalokiteśvara, the great bodhisattva being, “Which secret and marvelous Padmoṣṇīṣa maṇḍala, one that is the heart essence of Amoghapāśa, pertains to you, O Lord?

source: དེ་དག་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་ཤིག །
en: Please speak of that!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་གསོལ་བ་བཏབ་པར་རིག་ནས། ཕྱག་གཡས་པས་ལྟེ་བའི་པདྨའི་ཕྱག་རྒྱའི་རྣམ་པ་ལ་རེག་གོ། །རེག་མ་ཐག་ཏུ་ཕྱག་གཡས་པའི་པདྨ་ལ།
en: Noble Avalokiteśvara, the great bodhisattva being, considered the question of Vajrapāṇi, the great yakṣa general, and touched the lotus at his navel with his right hand formed into the shape of a mudrā.

source: སྙིང་པོའི་རིག་སྔགས་དེ་ཡང་པདྨའི་སྟེང་དུ་སྟེ།
en: As soon as he did, an image of himself wearing the garb of Brahmā appeared sitting on the vidyā lotus at his heart.

source: རང་གི་ངོ་བོ་གཞལ་མེད་ཁང་ཚངས་པའི་ཆ་བྱད་འཆང་བ་དོན་ཡོད་པའི་གཟུགས་སྤྱན་གསུམ་པ། ཕྱག་བཞི་པ།
en: The image had the form of Amoghapāśa with three eyes and four arms.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། ནོར་བུ་གསེར་གྱི་ཅོད་པན་ཅན། འོད་དཔག་མེད་ཀྱི་ཅོད་པན་གྱིས་བརྒྱན་པ།
en: It was adorned with all ornaments and wore a golden diadem inlaid with gems and adorned with Amitābha.

source: རལ་པའི་ཅོད་པན་པདྨའི་གཙུག་ཏོར་གྱིས་སྤུད་པ། ཟླ་བ་ཕྱེད་པས་རྣམ་པར་མཛེས་པ།
en: His matted hair was crowned with the lotus uṣṇīṣa and resplendent with the light of the crescent moon.

source: ཞགས་པ་འཆང་བ། པདྨའི་གཙུག་ཏོར་འཆང་བ་དང་། ནོར་བུའི་དབྱུག་པ་འཆང་བ་དང་། རྡོ་རྗེའི་དབྱུག་པ་འཆང་བ།
en: His hands held a noose, a lotus uṣṇīṣa, a jeweled staff, and a vajra staff.

source: སྐྱིལ་མོ་ཀྲུང་གིས་བཞུགས་པ། འོད་ཟེར་འབར་བས་ཡང་དག་པར་བརྒྱན་པ།
en: He sat in a cross-legged posture and was adorned with rays of light.

source: གོས་རྣམ་པར་བཀྲ་བ་སྣ་ཚོགས་དང་། སྤྱན་ཉི་མ་དང་ཟླ་བས་ལྷག་པར་འབར་བས་རྣམ་པར་མཛེས་པ། པདྨ་རྣམས་ཀྱི་སྟེང་ན་མཛེས་བཞིན་པ།
en: He wore various bright garments, and his eyes shone brighter than the sun and moon.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཐུགས་མཉེས་པར་བྱེད་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བར་འོས་པ། ལྷ་ཐམས་ཅད་ཀྱིས་མཆོད་པར་འོས་པ། ཀླུ་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་གཟུང་བར་འོས་པ། དྲང་སྲོང་ཐམས་ཅད་ཀྱིས་དགའ་བར་འོས་པ། ལྷ་མི་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་འགྲོ་བར་འོས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བླ་མར་འོས་པ་མཐོང་སྟེ།
en: Sitting on a lotus and resplendent with light, the image delighted the hearts of all the tathāgatas, was honored by all the bodhisattvas, was worshiped with offerings by all the devas, was viewed with kindness by all the nāgas, was rejoiced in by all the sages, was followed by all the asuras, garuḍas, kinnaras, and mahoragas, and served as the means of liberation for all beings.

source: དེ་ལྟ་བུའི་སྣང་བ་རྒྱ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། དེ་ཁོ་ན་ཉིད་གཅེས་པའི་སྙིང་པོར་གྱུར་པའི་སྙིང་པོ་ཉེ་བར་བསྟན་ཏོ།
en: In this way, Noble Avalokiteśvara, the great bodhisattva being, showed his true essence, the core essence of his own reality, in an elaborate display.

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས། འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དེ་མཐོང་བ་ཙམ་གྱི་མོད་ལ། སྙིང་པོ་གསང་བ། དོན་ཡོད་པའི་པདྨ་དྲི་མ་མེད་པའི་གཙུག་ཏོར་འོད་ཟེར་འབར་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་པར་གྱུར་ཏོ།
en: As soon as Vajrapāṇi, the great yakṣa general, and everyone else in the great gathering beheld this display of the secret heart essence, they obtained the samādhi called the blazing light of the immaculately pure uṣṇīṣa of the amogha lotus.

source: །ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་པ་གང་གིས་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་ནང་དུ་ཆུད་པར་གྱུར་ཏོ། །དེ་རྣམས་ཐམས་ཅད་རབ་ཏུ་མགུ་བའི་ཡིད་ཀྱིས་ཞབས་དག་གི་རྗེས་ལ་ཕྱག་འཚལ་བར་གྱུར་ཏོ།
en: Upon obtaining this samādhi, they entered the illusion-like samādhi and, overjoyed, fell down at the feet of Avalokiteśvara, bowing to him.
